Revit 2026 API

# TextBoxPromptText Property

---

The prompt text for the text box.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string PromptText { get; set; }
```
```vb
Public Property PromptText As String
	Get
	Set
```
```cpp
public:
property String^ PromptText {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member PromptText : string with get, set
```

#### Property Value

String

Prompt text is displayed when the text box is empty and does not have keyboard focus. This text is displayed in italics. The default value is .

#### Reference

TextBox Class

Autodesk.Revit.UI Namespace